tutorials/10unsteadyBB_topbottom/0/UliftBC
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      UliftBC;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Floor
    {
        type            zeroGradient;
    }
    Ceiling
    {
        type            zeroGradient;
    }

    Left
    {
        type            zeroGradient;
    }

    Right
    {
        type            zeroGradient;
    }

    Inlet
    {
        type            zeroGradient;
    }

    Outlet
    {
        type            fixedValue;
        value           uniform 0;
    }


    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
